<?php
 //โปรแกรมคำนวณหาพื้นที่ สี่เหลี่ยมผืนผ้า
 $width = 20.5;
 $length = 36.7;
 $are = $width * $length;

 echo ("ความกว้าง = " . $width . "เซนติเมตร <br>");
 echo ("ความยาว = " . $length . "เซนติเมตร <br>");
 echo ("พื้นที่สี่เหลี่ยมผืนผ้า = " . ($width * $length) . "ตารางเซนติเมตร");

//โปรแกรมคำนวณหาพื้นที่ สี่เหลี่ยมผืนผ้า
 echo ("<br> ปรแกรมคำนวณหาพื้นที่ สี่เหลี่ยม สามเหลี่ยม<br>");
 $base = 30.5;
 $heigth = 27.7;
 $are = 0.5 * $base * $heigth;

 echo ("ฐาน  = " .  $base . "เซนติเมตร <br>");
 echo ("สูง = " . $heigth . "เซนติเมตร <br>");
 echo ("พื้นที่สามเหลี่ยม = " . ($base* $length) . "ตารางเซนติเมตร");

?> 